"""
Задано символьний рядок. Розробити програму, яка вилучає з цього рядка всі
повторні входження цифр і знаків арифметичних операцій.
"""
# tuples = (1, 2, 2, 3, 3, 4, 5, 6, 7, 8, 9, 0, '*', '-', '+', '+')
# print(set(tuples))

"""
tuples = ('a', 'a', '1', '2', '2', '2', '3', '3', '4', '5', '6', '7', '8', '9', '0', '*', '-', '+', '+')
res = []
for i in range(len(tuples)):
      if 46 < ord(tuples[i]) < 58 or tuples[i] in '*+-':
            if tuples.count(tuples[i]) != 1:
                  res.append(tuples[i])
print(set(res))
